# Import Statements and Load Data

In [67]:
import pandas as pd
import numpy as np

import sqlite3

from pandasql import sqldf
psdf = lambda x: sqldf(x, globals())

import matplotlib as mp
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
conn = sqlite3.connect('Data/im.db')

query = ''' SELECT *
            FROM movie_basics
            JOIN movie_ratings
            USING(movie_id)
            ;'''

imdb_movies = pd.read_sql(query, conn)

imdb_movies.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

In [3]:
tn_movie_budgets = pd.read_csv('rawData/tn.movie_budgets.csv.gz', compression='gzip')

tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [4]:
bom_movie_gross = pd.read_csv('rawData/bom.movie_gross.csv.gz', compression='gzip')

bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

# Transform Data

In [5]:
def to_float(value):
    """Takes in a string or float. If string, removes up to 3 commas, 1 $ sign, and whitespace, then converts to float."""
    if type(value) == float:
        return value
    else:
        value = value.replace(',', '')
        value = value.replace(',', '')
        value = value.replace(',', '')
        value = value.replace('$', '')
        value = value.strip()
        return float(value)

#### Transform budget and revenue columns in tn_movie_budgets (to float)

In [6]:
tn_movie_budgets['production_budget'] = tn_movie_budgets['production_budget'].map(to_float)

In [7]:
tn_movie_budgets['domestic_gross'] = tn_movie_budgets['domestic_gross'].map(to_float)

In [8]:
tn_movie_budgets['worldwide_gross'] = tn_movie_budgets['worldwide_gross'].map(to_float)

#### Inspect all dataframes for missing values or unexpected behavior

In [24]:
imdb_movies.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

In [25]:
imdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         73856 non-null  object
 1   primary_title    73856 non-null  object
 2   original_title   73856 non-null  object
 3   start_year       73856 non-null  int64
 4   runtime_minutes  66236 non-null  float64
 5   genres           73052 non-null  object
 6   averagerating    73856 non-null  float64
 7   numvotes         73856 non-null  int64
dtypes: float64(2), int64(2), object(4)
memory usage: 4.5+ MB

In [27]:
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000.0,760507625.0,2.776345e+09
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09
2,3,"Jun 7, 2019",Dark Phoenix,350000000.0,42762350.0,1.497624e+08
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09

In [28]:
tn_movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   float64
 4   domestic_gross     5782 non-null   float64
 5   worldwide_gross    5782 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 271.2+ KB

In [29]:
bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [34]:
bom_movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   float64
 4   year            3387 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 132.4+ KB

#### Transform bom_movie_gross foreign_gross values (to float)

In [9]:
bom_movie_gross['foreign_gross'] = bom_movie_gross['foreign_gross'].map(to_float)

### Join all data into one table

#### Make a field called "movie_year" in all tables, to match records by film title and release year

In [10]:
imdb_movies['movie_year'] = imdb_movies['primary_title'] + ' ' + imdb_movies['start_year'].map(lambda x: str(x))

In [11]:
tn_movie_budgets['movie_year'] = tn_movie_budgets['movie'] + ' ' + tn_movie_budgets['release_date'].map(lambda x: x[-4:])

In [12]:
bom_movie_gross['movie_year'] = bom_movie_gross['title'] + ' ' + bom_movie_gross['year'].map(lambda x: str(x))

#### Use pandasql to join the tables on movie_year, and perform an inner join

In [105]:
query = ''' SELECT b.title, t.production_budget, t.domestic_gross, b.foreign_gross, t.worldwide_gross, i.runtime_minutes,
                    i.genres, b.studio, t.release_date, i.start_year, i.movie_id
            FROM tn_movie_budgets as t
            INNER JOIN imdb_movies as i
            USING(movie_year)
            INNER JOIN bom_movie_gross as b
            USING(movie_year)
            ;
            '''

movie_data = psdf(query)

#### Import directors & writers from imdb database for movies in movie_data

In [88]:
query = f''' SELECT d.movie_id, d.person_id, p.primary_name
            FROM directors as d
            JOIN persons as p
            USING(person_id)
            WHERE movie_id IN {tuple(preliminary_movie_data['movie_id'].values)}
            ;
            '''
directors = pd.read_sql(query, conn)

directors.head()

    movie_id  person_id        primary_name
0  tt1126618  nm0585011       Roger Michell
1  tt1336608  nm0788202       Adam Shankman
2  tt1336608  nm0788202       Adam Shankman
3  tt1336608  nm0788202       Adam Shankman
4  tt1341167  nm0606439  Christopher Morris

Some movie_id and person_id info is duplicated. Drop duplicates.

In [90]:
directors.drop_duplicates(inplace=True)

In [89]:
query = f''' SELECT w.movie_id, w.person_id, p.primary_name
            FROM writers as w
            JOIN persons as p
            USING(person_id)
            WHERE movie_id IN {tuple(preliminary_movie_data['movie_id'].values)}
            ;
            '''
writers = pd.read_sql(query, conn)

writers.head()

    movie_id  person_id         primary_name
0  tt1126618  nm0112459  Aline Brosh McKenna
1  tt1336608  nm0857620       Justin Theroux
2  tt1336608  nm0195476      Chris D'Arienzo
3  tt1336608  nm1615610           Allan Loeb
4  tt1341167  nm0606439   Christopher Morris

In [91]:
writers.drop_duplicates(inplace=True)

In [92]:
query = ''' SELECT m.title, m.production_budget, m.domestic_gross, m.foreign_gross, m.worldwide_gross, m.runtime_minutes,
                    m.genres, m.studio,
                    d.primary_name AS director,
                    w.primary_name AS writer,
                    m.release_date, m.start_year,
                    d.person_id AS director_id, w.person_id AS writer_id,
                    m.movie_id
            FROM preliminary_movie_data as m
            JOIN directors as d
            USING(movie_id)
            JOIN writers as w
            USING(movie_id)
            ;
            '''
psdf(query)

### Deal with Missing Values

In [106]:
movie_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1043 entries, 0 to 1042
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              1043 non-null   object
 1   production_budget  1043 non-null   float64
 2   domestic_gross     1043 non-null   float64
 3   foreign_gross      940 non-null    float64
 4   worldwide_gross    1043 non-null   float64
 5   runtime_minutes    1040 non-null   float64
 6   genres             1042 non-null   object
 7   studio             1043 non-null   object
 8   release_date       1043 non-null   object
 9   start_year         1043 non-null   int64
 10  movie_id           1043 non-null   object
dtypes: float64(5), int64(1), object(5)
memory usage: 89.8+ KB

#### Drop 3 records which are missing genres and / or runtime.

In [107]:
movie_data.dropna(subset=['genres', 'runtime_minutes'], inplace=True)

#### Inspect missing foreign_gross values.

The cell below was rerun after filling missing values in the foreign gross column. There are *still* 919 records for which the foreign_gross and domestic_gross do NOT add up to the worldwide_gross. The foreign_gross column comes from the Box Office Mojo dataset, whereas the domestic_gross and worldwide_gross came from The Numbers dataset. This could explain the discrepancy, though I am curious as to why they have different numbers. Is one of them more up to date? Does one of them include only box-office revenue, whereas the other includes DVD sales, selling rights to streaming services, and merchandise related to the film?

In [112]:
# How many records such that domestic gross + foreign gross NOT = worldwide gross?
len(movie_data.loc[movie_data['domestic_gross'] + movie_data['foreign_gross'] != movie_data['worldwide_gross']])

919

In [109]:
movie_data['foreign_gross'].isna().value_counts()

False    937
True     103
Name: foreign_gross, dtype: int64

#### Fill missing foreign_gross values with the difference between the worldwide gross and the domestic gross.

In [110]:
computed_foreign_gross = movie_data['worldwide_gross'] - movie_data['domestic_gross']

In [111]:
movie_data['foreign_gross'].fillna(value=computed_foreign_gross, inplace=True)